# =======================
# CLI Tools
# =======================

# Core dev
brew "git"
brew "git-lfs"
brew "chezmoi"

# Python ecosystem
brew "pixi"
brew "uv"

# Document / LaTeX
brew "ghostscript"

# Database
brew "postgresql@17", restart_service: :changed

# Mac App Store CLI
brew "mas"

# 用途次第で有効化
# brew "go"           # Go 開発するなら
# brew "wakeonlan"    # リモート起動するなら

# =======================
# GUI Apps (Casks)
# =======================

# Editor / Terminal
cask "visual-studio-code"
# cask "iterm2"         # ターミナル替える派なら
# cask "wezterm"        # モダンな選択肢

# Browser
cask "google-chrome"
# cask "firefox"
# cask "arc"

# Utility
cask "scroll-reverser"
# cask "raycast"        # Spotlight 代替
# cask "rectangle"      # ウィンドウ管理
# cask "appcleaner"     # アンインストール
# cask "the-unarchiver" # 解凍
# cask "1password"      # パスワードマネージャ

# Communication
cask "slack"
cask "zoom"
cask "discord"
cask "microsoft-teams"

# Mail
cask "microsoft-outlook"
cask "thunderbird"

# Productivity
cask "todoist"

# Microsoft Office
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"

# VPN / Network
cask "tailscale"

# =======================
# Container
# =======================
cask "orbstack"

# =======================
# Mac App Store
# =======================
mas "LINE", id: 539883307
# mas "Xcode", id: 497799835
# mas "Keynote", id: 409183694

# =======================
# VSCode Extensions
# =======================

# AI
vscode "anthropic.claude-code"
vscode "github.copilot-chat"

# Git
vscode "donjayamanne.githistory"
vscode "mhutchie.git-graph"

# Python / Jupyter
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.debugpy"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"

# C++
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"

# Remote
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"

# LaTeX
vscode "james-yu.latex-workshop"

# Database
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"

# Utility
vscode "mechatroner.rainbow-csv"
vscode "oderwat.indent-rainbow"
vscode "yzhang.markdown-all-in-one"
vscode "njzy.stats-bar"
vscode "ms-ceintl.vscode-language-pack-ja"
